
document.addEventListener('DOMContentLoaded', function () {
    const container = document.getElementById('realgrid01');
    const provider = new RealGrid.LocalDataProvider(false);
    const gridView = new RealGrid.GridView(container);
    gridView.setDataSource(provider);

    // 필드 생성
    var fields01 = [
        {fieldName: "일련번호", dataType: "number",},
        {fieldName: "읍면동", dataType: "text",},
        {fieldName: "지번", dataType: "text",},
        {fieldName: "동구분", dataType: "text",},
        {fieldName: "이의신청", dataType: "text",},
        {fieldName: "기준월", dataType: "text",},
    ]

    // 컬럼 생성
    var columns01 = [
        {name: "일련번호", fieldName: "일련번호", width: "76", numberFormat: '###0.###',
            header: {text: "일련번호",},
        },
        {name: "읍면동", fieldName: "읍면동", width: "76",
            header: {text: "읍면동",},
        },
        {name: "지번", fieldName: "지번", width: "76",
            header: {text: "지번",},
        },
        {name: "동구분", fieldName: "동구분", width: "76",
            header: {text: "동구분",},
        },
        {name: "이의신청", fieldName: "이의신청", width: "61",
            header: {text: "이의\n신청",styleName: "multi-line-css"},
        },
        {name: "기준월", fieldName: "기준월", width: "62",
            header: {text: "기준월",},
        },
    ]

    // 로우 생성
    var rows01 = [
        {일련번호: '1442', 읍면동: '서구1동', 지번: '1-1668', 동구분: '10', 이의신청: '', 기준월: '1.1',},
        {일련번호: '1443', 읍면동: '서구1동', 지번: '1-1668', 동구분: '10', 이의신청: '', 기준월: '1.1',},
        {일련번호: '1444', 읍면동: '서구1동', 지번: '1-1668', 동구분: '10', 이의신청: '', 기준월: '1.1',},
        {일련번호: '1445', 읍면동: '서구1동', 지번: '1-1668', 동구분: '10', 이의신청: '', 기준월: '1.1',},
        {일련번호: '1446', 읍면동: '서구1동', 지번: '1-1668', 동구분: '10', 이의신청: '', 기준월: '1.1',},
        {일련번호: '1447', 읍면동: '서구1동', 지번: '1-1668', 동구분: '10', 이의신청: '', 기준월: '1.1',},
        {일련번호: '1448', 읍면동: '서구1동', 지번: '1-1668', 동구분: '10', 이의신청: '', 기준월: '1.1',},
        {일련번호: '1449', 읍면동: '서구1동', 지번: '1-1668', 동구분: '10', 이의신청: '', 기준월: '1.1',},
        {일련번호: '1450', 읍면동: '서구1동', 지번: '1-1668', 동구분: '10', 이의신청: '', 기준월: '1.1',},
        {일련번호: '1451', 읍면동: '서구1동', 지번: '1-1668', 동구분: '10', 이의신청: '', 기준월: '1.1',},
        {일련번호: '1452', 읍면동: '서구1동', 지번: '1-1668', 동구분: '10', 이의신청: '', 기준월: '1.1',},
        {일련번호: '1453', 읍면동: '서구1동', 지번: '1-1668', 동구분: '10', 이의신청: '', 기준월: '1.1',},
        {일련번호: '1454', 읍면동: '서구1동', 지번: '1-1668', 동구분: '10', 이의신청: '', 기준월: '1.1',},
        {일련번호: '1455', 읍면동: '서구1동', 지번: '1-1668', 동구분: '10', 이의신청: '', 기준월: '1.1',},
        {일련번호: '1456', 읍면동: '서구1동', 지번: '1-1668', 동구분: '10', 이의신청: '', 기준월: '1.1',},
        {일련번호: '1457', 읍면동: '서구1동', 지번: '1-1668', 동구분: '10', 이의신청: '', 기준월: '1.1',},
        {일련번호: '1458', 읍면동: '서구1동', 지번: '1-1668', 동구분: '10', 이의신청: '', 기준월: '1.1',},
        {일련번호: '1459', 읍면동: '서구1동', 지번: '1-1668', 동구분: '10', 이의신청: '', 기준월: '1.1',},
        {일련번호: '1460', 읍면동: '서구1동', 지번: '1-1668', 동구분: '10', 이의신청: '', 기준월: '1.1',},
        {일련번호: '1461', 읍면동: '서구1동', 지번: '1-1668', 동구분: '10', 이의신청: '', 기준월: '1.1',},
        {일련번호: '1450', 읍면동: '서구1동', 지번: '1-1668', 동구분: '10', 이의신청: '', 기준월: '1.1',},
        {일련번호: '1451', 읍면동: '서구1동', 지번: '1-1668', 동구분: '10', 이의신청: '', 기준월: '1.1',},
        {일련번호: '1452', 읍면동: '서구1동', 지번: '1-1668', 동구분: '10', 이의신청: '', 기준월: '1.1',},
        {일련번호: '1453', 읍면동: '서구1동', 지번: '1-1668', 동구분: '10', 이의신청: '', 기준월: '1.1',},
        {일련번호: '1454', 읍면동: '서구1동', 지번: '1-1668', 동구분: '10', 이의신청: '', 기준월: '1.1',},
        {일련번호: '1455', 읍면동: '서구1동', 지번: '1-1668', 동구분: '10', 이의신청: '', 기준월: '1.1',},
        {일련번호: '1456', 읍면동: '서구1동', 지번: '1-1668', 동구분: '10', 이의신청: '', 기준월: '1.1',},
        {일련번호: '1457', 읍면동: '서구1동', 지번: '1-1668', 동구분: '10', 이의신청: '', 기준월: '1.1',},
        {일련번호: '1458', 읍면동: '서구1동', 지번: '1-1668', 동구분: '10', 이의신청: '', 기준월: '1.1',},
        {일련번호: '1459', 읍면동: '서구1동', 지번: '1-1668', 동구분: '10', 이의신청: '', 기준월: '1.1',},
        {일련번호: '1460', 읍면동: '서구1동', 지번: '1-1668', 동구분: '10', 이의신청: '', 기준월: '1.1',},
        {일련번호: '1461', 읍면동: '서구1동', 지번: '1-1668', 동구분: '10', 이의신청: '', 기준월: '1.1',},
    ]


    var layout01

    layout01 = [
    {
        name: "일반",direction: "horizontal",
        items: [
            "일련번호",
            "읍면동",
            "지번",
            "동구분"
        ],
        header: {text: "일반",styleName: "multi-line-css"}
    }, 
    "이의신청","기준월",
    ]

    provider.setFields(fields01); //필드설정
    gridView.setColumns(columns01); //컬럼설정
    provider.setRows(rows01); //데이터 채우기


    gridView.setCheckBar({
        visible: false
    });
    gridView.setStateBar({
        visible: false
    });
    gridView.setRowIndicator({
        visible: false
    });
    gridView.setFooters({
        visible:false,
    });

    gridView.displayOptions.fitStyle = "even";
    gridView.header.heights = [30,30]
    gridView.displayOptions.minRowHeight = 36;
    gridView.displayOptions.useFocusClass = true;
    
    gridView.setColumnLayout(layout01);

    //realGrid scrollbar style
    gridView.scrollBarWidth = 10;
    gridView.scrollBarHeight = 10;
    gridView.scrollBarRadius = 5;

    

});
